app/controllers/myblogs_controller.rb

SELECT "myblogs".* FROM "myblogs"
---
  def index
    @myblogs = Myblog.all

INSERT INTO "myblogs" ("title", "user_id", "abstract", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "第一篇blog"], ["user_id", 1], ["abstract", "这是第一篇blog摘要"], ["content", "这是第一篇blog内容"], ["created_at", "2017-08-11 06:11:12.763711"], ["updated_at", "2017-08-11 06:11:12.763711"]]
---
  def create
    @myblog = Myblog.new(myblog_params)

    respond_to do |format|
      if @myblog.save

UPDATE "myblogs" SET "title" = ?, "abstract" = ?, "content" = ?, "updated_at" = ? WHERE "myblogs"."id" = ?  [["title", "测试文本编辑器2"], ["abstract", "测试文本编辑器摘要2"], ["content", "<span>内容测试 文本编辑器2</span>"], ["updated_at", "2017-08-11 11:34:11.041559"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @myblog.update(myblog_params)

SELECT  "myblogs".* FROM "myblogs" WHERE "myblogs"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_myblog
      @myblog = Myblog.find(params[:id])