app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    # @users = User.all
     @users = User.paginate(page: params[:page],per_page:1)

UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "sunct001"], ["updated_at", "2017-07-25 03:30:06.786241"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update_attributes(user_params)